smartinou/pfpp/solution/ethernet/startup_TM4C129ENCPDT.c
/* File: startup_TM4C123GH6PM.c
 * Purpose: startup file for TM4C123GH6PM Cortex-M4 device.
 *          Should be used with GCC 'GNU Tools ARM Embedded'
 * Version: CMSIS 5.0.1
 * Date: 2017-09-13
 *
 * Created from the CMSIS template for the specified device
 * Quantum Leaps, www.state-machine.com
 *
 * NOTE:
 * The function assert_failed defined at the end of this file defines
 * the error/assertion handling policy for the application and might
 * need to be customized for each project. This function is defined in
 * assembly to re-set the stack pointer, in case it is corrupted by the
 * time assert_failed is called.
 */


// Start and end of stack defined in the linker script.
//extern int __stack_start__;
extern int __stack_end__;

// Weak prototypes for error handlers.
///
// \note
// The function assert_failed defined at the end of this file defines
// the error/assertion handling policy for the application and might
// need to be customized for each project. This function is defined in
// assembly to avoid accessing the stack, which might be corrupted by
// the time assert_failed is called.
void assert_failed(char const *aModule, int const aLoc);

// Function prototypes -----------------------------------------------------*/
void Default_Handler();  // Default empty handler.
void Reset_Handler();    // Reset Handler.
void SystemInit();       // CMSIS system initialization.
//void Q_onAssert(char const *module, int loc); // QP assertion handler.

//----------------------------------------------------------------------------
// weak aliases for each Exception handler to the Default_Handler.
// Any function with the same name will override these definitions.
// Cortex-M Processor fault exceptions...
void NMI_Handler           () __attribute__ ((weak));
void HardFault_Handler     () __attribute__ ((weak));
void MemManage_Handler     () __attribute__ ((weak));
void BusFault_Handler      () __attribute__ ((weak));
void UsageFault_Handler    () __attribute__ ((weak));

// Cortex-M Processor non-fault exceptions...
void SVC_Handler           () __attribute__ ((weak, alias("Default_Handler")));
void DebugMon_Handler      () __attribute__ ((weak, alias("Default_Handler")));
void PendSV_Handler        () __attribute__ ((weak, alias("Default_Handler")));
void SysTick_Handler       () __attribute__ ((weak, alias("Default_Handler")));

// external interrupts...
void GPIOPortA_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortB_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortC_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortD_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortE_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void UART0_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void UART1_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void SSI0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void PWMFault_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void PWMGen0_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void PWMGen1_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void PWMGen2_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void QEI0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void ADCSeq0_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void ADCSeq1_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void ADCSeq2_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void ADCSeq3_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Watchdog_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void Timer0A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer0B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer1A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer1B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer2A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer2B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Comp0_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void Comp1_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void Comp2_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void SysCtrl_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void FlashCtrl_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortF_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortG_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortH_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void UART2_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void SSI1_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void Timer3A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer3B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void I2C1_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
//void QEI1_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void CAN0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void CAN1_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
//void CAN2_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void EMAC0_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void Hibernate_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void USB0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void PWMGen3_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void uDMAST_IRQHandler     () __attribute__ ((weak, alias("Default_Handler")));
void uDMAError_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void ADC1Seq0_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void ADC1Seq1_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void ADC1Seq2_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void ADC1Seq3_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
void EPI0_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortJ_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortK_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortL_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void SSI2_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void SSI3_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void UART3_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void UART4_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void UART5_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void UART6_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void UART7_IRQHandler      () __attribute__ ((weak, alias("Default_Handler")));
void I2C2_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C3_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void Timer4A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer4B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer5A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer5B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer0A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer0B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer1A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer1B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer2A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer2B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer3A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer3B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer4A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer4B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer5A_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
//void WideTimer5B_IRQHandler() __attribute__ ((weak, alias("Default_Handler")));
void FPU_IRQHandler        () __attribute__ ((weak, alias("Default_Handler")));
void I2C4_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C5_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortM_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortN_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
//void QEI2_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void Tamper_IRQHandler     () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP0_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP1_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP2_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP3_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP4_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP5_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP6_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortP7_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ0_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ1_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ2_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ3_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ4_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ5_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ6_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
void GPIOPortQ7_IRQHandler () __attribute__ ((weak, alias("Default_Handler")));
//void GPIOPortR_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
//void GPIOPortS_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
//void PWM1Gen0_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
//void PWM1Gen1_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
//void PWM1Gen2_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
//void PWM1Gen3_IRQHandler   () __attribute__ ((weak, alias("Default_Handler")));
//void PWM1Fault_IRQHandler  () __attribute__ ((weak, alias("Default_Handler")));
void SHA_IRQHandler        () __attribute__ ((weak, alias("Default_Handler")));
void AES_IRQHandler        () __attribute__ ((weak, alias("Default_Handler")));
void DES_IRQHandler        () __attribute__ ((weak, alias("Default_Handler")));
void Timer6A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer6B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer7A_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void Timer7B_IRQHandler    () __attribute__ ((weak, alias("Default_Handler")));
void I2C6_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C7_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C8_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));
void I2C9_IRQHandler       () __attribute__ ((weak, alias("Default_Handler")));


